Config/Documents/НачислениеСтудентамЗаПрочиеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеСтудентамЗаПрочиеУслуги</Name>
			<BasedOn>
				<xr:Item>Document.КорректировкаДоходовБудущихПериодовОбразование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИсполнениеДоговоровСПокупателями</xr:Item>
				<xr:Item>InformationRegister.ДокументыПоНеоблагаемымНДСОперациям</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСоСтудентамиДопУслуги</xr:Item>
				<xr:Item>AccumulationRegister.НДСНеоблагаемыеОперации</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРабочихДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеЗаУслугу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НачисленияСтудентамЗаПрочиеУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисленияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факультет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийНачисленияУчащимся</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДоходовБудущихПериодовОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДнейПосещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Comment>Идентификатор строки - для связи с документов "Квитанция на оплату"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготыСтудентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислениеЗаУслугу</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НачисленияСтудентамЗаПрочиеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисленияКонец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисленияНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокВыпискиСФ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокВыпискиСФЗаУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиОплатыОбразование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДБП</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДБП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПризнанияДоходов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПризнанияРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаСписания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияСписания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЧислитель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЗнаменатель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДоходов1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДоходов2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДоходов3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДеятельностиНУ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДеятельностиДляНалоговогоУчетаЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоходовНУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяПрочихДоходовНУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтразитьВГрафикеИсполненияДоговора</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыДокументовКонтрольИсполненияДоговоров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОформлятьЭД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДБПВВалюте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыОперацийНачисленияУчащимся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийНачисленияУчащимся</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДолгосрочнымДоговорам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКраткосрочнымДоговорам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/НачислениеСтудентамЗаПрочиеУслуги/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		
		ПериодНачисления = НачалоМесяца(ТекущаяДатаСеанса());
		ВалютаДокумента = ОбщегоНазначенияБГУПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		Курс = СтруктураКурса.Курс;
		Кратность = СтруктураКурса.Кратность;
		
	КонецЕсли; 
	
	Если ДанныеЗаполнения <> Неопределено И ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") тогда
		ТекстСообщения = "";
		Если НЕ Документы.НачислениеСтудентамЗаПрочиеУслуги.ЗаполнитьНаОсновании(ДанныеЗаполнения, ЭтотОбъект, ТекстСообщения) тогда
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Не УчитыватьНДС Тогда
		НепроверяемыеРеквизиты.Добавить("Начисления.ПорядокВыпискиСФ");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийНачисленияУчащимся.ПоДолгосрочнымДоговорам Тогда
		НепроверяемыеРеквизиты.Добавить("Начисления.ПериодНачисленияНачало");
		НепроверяемыеРеквизиты.Добавить("Начисления.ПериодНачисленияКонец");
	Иначе
		
		Для каждого СтрокаНачисления Из Начисления Цикл
			
			Если УчитыватьНДС Тогда
				ПроверитьЗаполнениеСуммыНДСВСтроке(СтрокаНачисления, Отказ);
			КонецЕсли;
			
			ПроверитьЗаполнениеПериодаНачисленияВСтроке(СтрокаНачисления, Отказ);
			
		КонецЦикла;
		
		ПроверитьДублиСтрокИСуществующиеНачисления(Отказ);
	
	КонецЕсли;
	
	ПроверитьФакультетыОсновногоОбучения(Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	// Соответствие вида начисления и вида операции.
	Если ЗначениеЗаполнено(НачислениеЗаУслугу) Тогда
		
		ПараметрыНачисленияЗаУслугу = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НачислениеЗаУслугу, "ВидНачисления");
		Если ВидОперации <> ПараметрыНачисленияЗаУслугу.ВидНачисления Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Вид начисления ""%1"" не соответствует виду операции документа ""%2"".'"),
					ВидОперации, ПараметрыНачисленияЗаУслугу.ВидНачисления);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "НачислениеЗаУслугу", "Объект", Отказ);
		КонецЕсли;
		
	Иначе // Начисление за услугу указывается в строке табличной части.
		
		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	КонтрольИсполненияДоговоров.ОчиститьДвиженияРегистровПодсистемы(ЭтотОбъект);
	
	МассивИдентификаторовСтрок = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		//Если ссылка пустая, значит документ новый, устанавливаем новые идентификаторы всем строкам
		Для Каждого СтрТЧ Из Начисления Цикл
			Если НЕ ЗначениеЗаполнено(СтрТЧ.ИДСтроки) Тогда
				СтрТЧ.ИДСтроки = Строка(Новый УникальныйИдентификатор);			
			ИначеЕсли МассивИдентификаторовСтрок.Найти(СтрТЧ.ИДСтроки)<>Неопределено Тогда
				СтрТЧ.ИДСтроки = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			МассивИдентификаторовСтрок.Добавить(СтрТЧ.ИДСтроки);
		КонецЦикла;
	Иначе
		//Если ссылка не пустая, нужен анализ идентификаторов строк.
		//Т.к. возможна ситуация, когда строку скопировали, а исходную - удалили.
		//В этом случае нужно ранее присвоенные идентификаторы назначить новым строкам.
		Запрос = Новый Запрос("ВЫБРАТЬ
	      |	НачислениеРодительскойПлатыНачисления.НомерСтроки,
	      |	НачислениеРодительскойПлатыНачисления.Студент КАК Учащийся,
	      |	НачислениеРодительскойПлатыНачисления.Контрагент,
	      |	НачислениеРодительскойПлатыНачисления.ДоговорКонтрагента,
	      |	НачислениеРодительскойПлатыНачисления.ИДСтроки
	      |ПОМЕСТИТЬ ТекущиеНачисления
	      |ИЗ
	      |	&Начисления КАК НачислениеРодительскойПлатыНачисления
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	НачислениеРодительскойПлатыНачисления.НомерСтроки,
	      |	НачислениеРодительскойПлатыНачисления.Студент КАК Учащийся,
	      |	НачислениеРодительскойПлатыНачисления.Контрагент,
	      |	НачислениеРодительскойПлатыНачисления.ДоговорКонтрагента,
	      |	НачислениеРодительскойПлатыНачисления.ИДСтроки
	      |ПОМЕСТИТЬ ДанныеДокумента
	      |ИЗ
	      |	Документ.НачислениеЗаУслугиОбразования.Начисления КАК НачислениеРодительскойПлатыНачисления
	      |ГДЕ
	      |	НачислениеРодительскойПлатыНачисления.Ссылка = &Ссылка
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	ТекущиеНачисления.НомерСтроки,
	      |	ТекущиеНачисления.Учащийся,
	      |	ТекущиеНачисления.Контрагент,
	      |	ТекущиеНачисления.ДоговорКонтрагента,
	      |	ТекущиеНачисления.ИДСтроки,
	      |	ДанныеДокумента.НомерСтроки КАК НомерСтрокиИсх,
	      |	ДанныеДокумента.ИДСтроки КАК ИДСтрокиИсх,
	      |	ДанныеДокумента.Учащийся КАК УчащийсяИсх,
	      |	ДанныеДокумента.Контрагент КАК КонтрагентИсх,
	      |	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагентаИсх
	      |ПОМЕСТИТЬ СвязанныеТаблицы
	      |ИЗ
	      |	ТекущиеНачисления КАК ТекущиеНачисления
	      |		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
	      |		ПО ТекущиеНачисления.Учащийся = ДанныеДокумента.Учащийся
	      |			И ТекущиеНачисления.Контрагент = ДанныеДокумента.Контрагент
	      |			И ТекущиеНачисления.ДоговорКонтрагента = ДанныеДокумента.ДоговорКонтрагента
	      |			И ТекущиеНачисления.ИДСтроки = ДанныеДокумента.ИДСтроки
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	СвязанныеТаблицы.НомерСтрокиИсх,
	      |	СвязанныеТаблицы.ИДСтрокиИсх,
	      |	СвязанныеТаблицы.УчащийсяИсх,
	      |	СвязанныеТаблицы.КонтрагентИсх,
	      |	СвязанныеТаблицы.ДоговорКонтрагентаИсх
	      |ПОМЕСТИТЬ СвободныеИдентификаторы
	      |ИЗ
	      |	СвязанныеТаблицы КАК СвязанныеТаблицы
	      |ГДЕ
	      |	СвязанныеТаблицы.НомерСтроки ЕСТЬ NULL 
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	СвязанныеТаблицы.НомерСтроки КАК НомерСтроки,
	      |	СвободныеИдентификаторы.ИДСтрокиИсх
	      |ИЗ
	      |	СвязанныеТаблицы КАК СвязанныеТаблицы
	      |		ЛЕВОЕ СОЕДИНЕНИЕ СвободныеИдентификаторы КАК СвободныеИдентификаторы
	      |		ПО СвязанныеТаблицы.Учащийся = СвободныеИдентификаторы.УчащийсяИсх
	      |			И СвязанныеТаблицы.Контрагент = СвободныеИдентификаторы.КонтрагентИсх
	      |			И СвязанныеТаблицы.ДоговорКонтрагента = СвободныеИдентификаторы.ДоговорКонтрагентаИсх
	      |ГДЕ
	      |	СвязанныеТаблицы.НомерСтрокиИсх ЕСТЬ NULL
		  |	И НЕ СвободныеИдентификаторы.ИДСтрокиИсх ЕСТЬ NULL
	      |
	      |УПОРЯДОЧИТЬ ПО
	      |	НомерСтроки
	      |ИТОГИ ПО
	      |	НомерСтроки");
							  
		Запрос.УстановитьПараметр("Начисления",Начисления.Выгрузить());
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Для Каждого СтрТЧ Из Начисления Цикл
			Если НЕ ЗначениеЗаполнено(СтрТЧ.ИДСтроки) Тогда
				Если Выборка.НайтиСледующий(Новый Структура("НомерСтроки",СтрТЧ.НомерСтроки)) Тогда
					ВыборкаДетальная = Выборка.Выбрать();
					Пока ВыборкаДетальная.Следующий() Цикл
						Если МассивИдентификаторовСтрок.Найти(ВыборкаДетальная.ИДСтрокиИсх) = Неопределено Тогда
							СтрТЧ.ИДСтроки = ВыборкаДетальная.ИДСтрокиИсх;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрТЧ.ИДСтроки) Тогда
					СтрТЧ.ИДСтроки = Строка(Новый УникальныйИдентификатор);
				КонецЕсли;
			ИначеЕсли МассивИдентификаторовСтрок.Найти(СтрТЧ.ИДСтроки)<>Неопределено Тогда
				СтрТЧ.ИДСтроки = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			МассивИдентификаторовСтрок.Добавить(СтрТЧ.ИДСтроки);
		КонецЦикла;
	КонецЕсли;
	
	ПериодНачисления = НачалоМесяца(ПериодНачисления);
	
	Если УчитыватьНДС Тогда
		СуммаДокумента = Начисления.Итог("Сумма") + ?(СуммаВключаетНДС, 0, Начисления.Итог("СуммаНДС"));
	Иначе
		СуммаВключаетНДС = Ложь;
		СуммаДокумента = Начисления.Итог("Сумма");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.НачислениеСтудентамЗаПрочиеУслуги.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "РасчетыСоСтудентамиДопУслуги");
	
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "НДСНеоблагаемыеОперации");
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "ДокументыПоНеоблагаемымНДСОперациям");
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДублиСтрокИСуществующиеНачисления(Отказ)
	
	ШаблонТекстДублей = НСтр("ru = 'Для учащегося ""%1"" повторяется начисление за услугу ""%2"" по аналитике: плательщик ""%3"", договор ""%4"", период с %5 по %6 и ставке ""%7""'");
	ШаблонТекстНачислений = НСтр("ru = 'Для учащегося %1 по договору %2 уже есть начисление по услуге %3 за выбранный период,
							|на сумму %4 в документе %5'");
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаНачислений.НомерСтроки КАК НомерСтроки,
	               |	ТаблицаНачислений.Студент КАК Студент,
	               |	ТаблицаНачислений.Контрагент КАК Контрагент,
	               |	ТаблицаНачислений.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ТаблицаНачислений.ПериодНачисленияНачало КАК ПериодНачисленияНачало,
	               |	ТаблицаНачислений.ПериодНачисленияКонец КАК ПериодНачисленияКонец,
	               |	ТаблицаНачислений.СтавкаОплаты КАК СтавкаОплаты,
	               |	ТаблицаНачислений.НачислениеЗаУслугу КАК НачислениеЗаУслугу
	               |ПОМЕСТИТЬ ТаблицаНачислений
	               |ИЗ
	               |	&ТаблицаНачислений КАК ТаблицаНачислений
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Студент,
	               |	ПериодНачисленияНачало,
	               |	ПериодНачисленияКонец,
	               |	СтавкаОплаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНачислений.Студент КАК Студент,
	               |	ТаблицаНачислений.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	НачисленияФактическиеДопУслуги.НачислениеЗаУслугу КАК НачислениеЗаУслугу,
	               |	СУММА(НачисленияФактическиеДопУслуги.СуммаВзаиморасчетов) КАК Сумма,
	               |	НачисленияФактическиеДопУслуги.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ФактическиеНачисления
	               |ИЗ
	               |	ТаблицаНачислений КАК ТаблицаНачислений
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСоСтудентамиДопУслуги КАК НачисленияФактическиеДопУслуги
	               |		ПО ТаблицаНачислений.Студент = НачисленияФактическиеДопУслуги.Студент
	               |			И ТаблицаНачислений.ДоговорКонтрагента = НачисленияФактическиеДопУслуги.ДоговорКонтрагента
	               |ГДЕ
	               |	НачисленияФактическиеДопУслуги.Регистратор <> &Регистратор
	               |	И ТИПЗНАЧЕНИЯ(НачисленияФактическиеДопУслуги.Регистратор) = ТИП(Документ.НачислениеСтудентамЗаПрочиеУслуги)
	               |	И НачисленияФактическиеДопУслуги.Факультет = &Факультет
	               |	И НачисленияФактическиеДопУслуги.Период = &ПериодНачисления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаНачислений.Студент,
	               |	ТаблицаНачислений.ДоговорКонтрагента,
	               |	ТаблицаНачислений.ПериодНачисленияКонец,
	               |	НачисленияФактическиеДопУслуги.Регистратор,
	               |	НачисленияФактическиеДопУслуги.НачислениеЗаУслугу
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(НачисленияФактическиеДопУслуги.СуммаВзаиморасчетов) > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ТаблицаНачислений.НомерСтроки) КАК НомерСтроки,
	               |	ТаблицаНачислений.Студент КАК Студент,
	               |	ТаблицаНачислений.Контрагент КАК Контрагент,
	               |	ТаблицаНачислений.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ТаблицаНачислений.ПериодНачисленияНачало КАК ПериодНачисленияНачало,
	               |	ТаблицаНачислений.ПериодНачисленияКонец КАК ПериодНачисленияКонец,
	               |	ТаблицаНачислений.СтавкаОплаты КАК СтавкаОплаты,
	               |	ТаблицаНачислений.НачислениеЗаУслугу КАК НачислениеЗаУслугу
	               |ИЗ
	               |	ТаблицаНачислений КАК ТаблицаНачислений
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаНачислений.Студент,
	               |	ТаблицаНачислений.Контрагент,
	               |	ТаблицаНачислений.ДоговорКонтрагента,
	               |	ТаблицаНачислений.ПериодНачисленияНачало,
	               |	ТаблицаНачислений.ПериодНачисленияКонец,
	               |	ТаблицаНачислений.СтавкаОплаты,
	               |	ТаблицаНачислений.НачислениеЗаУслугу
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(*) > 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНачислений.НомерСтроки КАК НомерСтроки,
	               |	ТаблицаНачислений.Студент КАК Студент,
	               |	ТаблицаНачислений.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ТаблицаНачислений.НачислениеЗаУслугу КАК НачислениеЗаУслугу,
	               |	ЕСТЬNULL(НачисленияФактическиеДопУслуги.Сумма, 0) КАК Сумма,
	               |	ЕСТЬNULL(НачисленияФактическиеДопУслуги.Регистратор, НЕОПРЕДЕЛЕНО) КАК ДокументНачисления
	               |ИЗ
	               |	ТаблицаНачислений КАК ТаблицаНачислений
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ФактическиеНачисления КАК НачисленияФактическиеДопУслуги
	               |		ПО ТаблицаНачислений.Студент = НачисленияФактическиеДопУслуги.Студент
	               |			И ТаблицаНачислений.ДоговорКонтрагента = НачисленияФактическиеДопУслуги.ДоговорКонтрагента
	               |			И ТаблицаНачислений.НачислениеЗаУслугу = НачисленияФактическиеДопУслуги.НачислениеЗаУслугу
	               |ГДЕ
	               |	ЕСТЬNULL(НачисленияФактическиеДопУслуги.Сумма, 0) <> 0";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаНачислений", Начисления.Выгрузить(, "НомерСтроки, Студент, Контрагент, ДоговорКонтрагента, ПериодНачисленияНачало, ПериодНачисленияКонец, СтавкаОплаты, НачислениеЗаУслугу"));
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Факультет", Факультет);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	// МассивРезультатов[0] - ВТ ТаблицаНачислений
	// МассивРезультатов[1] - ВТ ФактическиеНачисления
	ВыборкаДублей = МассивРезультатов[2].Выбрать();
	ВыборкаНачислений = МассивРезультатов[3].Выбрать();
	
	Пока ВыборкаДублей.Следующий() Цикл
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонТекстДублей,
			ВыборкаДублей.Студент,
			ВыборкаДублей.НачислениеЗаУслугу,
			ВыборкаДублей.Контрагент,
			ВыборкаДублей.ДоговорКонтрагента,
			Формат(ВыборкаДублей.ПериодНачисленияНачало, "ДЛФ=D"),
			Формат(ВыборкаДублей.ПериодНачисленияКонец, "ДЛФ=D"),
			ВыборкаДублей.СтавкаОплаты
		);
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Начисления", ВыборкаДублей.НомерСтроки, "Студент");
		ОбщегоНазначения.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
		
	КонецЦикла;
	
	Пока ВыборкаНачислений.Следующий() Цикл
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонТекстНачислений,
			ВыборкаНачислений.Студент,
			ВыборкаНачислений.ДоговорКонтрагента,
			ВыборкаНачислений.НачислениеЗаУслугу,
			ВыборкаНачислений.Сумма,
			ВыборкаНачислений.ДокументНачисления
		);
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Начисления",
			ВыборкаНачислений.НомерСтроки, "Студент");
		ОбщегоНазначения.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеСуммыНДСВСтроке(СтрокаНачисления, Отказ)

	Если СтрокаНачисления.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС И СтрокаНачисления.СтавкаНДС <> Перечисления.СтавкиНДС.НДС0 Тогда
		
		Если СтрокаНачисления.СуммаНДС = 0 Тогда
			
			ШаблонСуммаНДС = НСтр("ru = 'Не заполнена колонка ""Сумма НДС"" в строке %НомерСтроки% списка ""Начисления""'");
			ТекстСообщения = СтрЗаменить(ШаблонСуммаНДС, "%НомерСтроки%", Строка(СтрокаНачисления.НомерСтроки));
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Начисления", СтрокаНачисления.НомерСтроки, "СуммаНДС");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
		
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьЗаполнениеПериодаНачисленияВСтроке(СтрокаНачисления, Отказ)

	Если СтрокаНачисления.ПериодНачисленияНачало < НачалоМесяца(ПериодНачисления) Тогда
		
		ШаблонНачалоПериода = НСтр("ru = 'Дата начала начисления в строке %НомерСтроки% списка ""Начисления"" меньше, чем период начисления документа'");
		ТекстСообщения = СтрЗаменить(ШаблонНачалоПериода, "%НомерСтроки%", Строка(СтрокаНачисления.НомерСтроки));
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Начисления", СтрокаНачисления.НомерСтроки, "ПериодНачисленияНачало");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
	КонецЕсли; 
	
	Если СтрокаНачисления.ПериодНачисленияКонец > КонецМесяца(ПериодНачисления) Тогда
		
		ШаблонКонецПериода = НСтр("ru = 'Дата конца начисления в строке %НомерСтроки% списка ""Начисления"" больше, чем период начисления документа'");
		ТекстСообщения = СтрЗаменить(ШаблонКонецПериода, "%НомерСтроки%", Строка(СтрокаНачисления.НомерСтроки));
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Начисления", СтрокаНачисления.НомерСтроки, "ПериодНачисленияКонец");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
		
	КонецЕсли; 

КонецПроцедуры
 
Процедура ПроверитьФакультетыОсновногоОбучения(Отказ)
	
	ШаблонТекстФакультеты = НСтр("ru = 'Для учащегося ""%1"" по прочим услугам указано начисление по основному факультету, при этом основных факультетов задано %2'");
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаНачислений.НомерСтроки,
	               |	ТаблицаНачислений.Студент КАК Студент,
	               |	ТаблицаНачислений.Контрагент,
	               |	ТаблицаНачислений.ДоговорКонтрагента,
	               |	ТаблицаНачислений.ПериодНачисленияНачало КАК ПериодНачисленияНачало,
	               |	ТаблицаНачислений.ПериодНачисленияКонец КАК ПериодНачисленияКонец,
	               |	ТаблицаНачислений.СтавкаОплаты КАК СтавкаОплаты,
				   |	ТаблицаНачислений.НачислениеЗаУслугу КАК НачислениеЗаУслугу
	               |ПОМЕСТИТЬ ТаблицаНачислений
	               |ИЗ
	               |	&ТаблицаНачислений КАК ТаблицаНачислений
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Студент,
	               |	ПериодНачисленияНачало,
	               |	ПериодНачисленияКонец
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ТаблицаНачислений.НомерСтроки) КАК НомерСтроки,
	               |	ТаблицаНачислений.Студент,
	               |	ТаблицаНачислений.Контрагент,
	               |	ТаблицаНачислений.ДоговорКонтрагента
	               |ИЗ
	               |	ТаблицаНачислений КАК ТаблицаНачислений
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаНачислений.Студент,
	               |	ТаблицаНачислений.Контрагент,
	               |	ТаблицаНачислений.ДоговорКонтрагента
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(*) > 1
	               |;";
	//Запрос.Текст = ТекстЗапроса;
	//Запрос.УстановитьПараметр("ТаблицаНачислений", Начисления.Выгрузить(, "НомерСтроки, Студент, Контрагент, ДоговорКонтрагента"));
	//Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	//Запрос.УстановитьПараметр("Факультет", Факультет);
	//Запрос.УстановитьПараметр("Регистратор", Ссылка);
	//
	//МассивРезультатов = Запрос.ВыполнитьПакет();
	//ВыборкаДублей = МассивРезультатов[1].Выбрать();	
	//
	//Пока ВыборкаДублей.Следующий() Цикл
	//	
	//	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//		ШаблонТекстДублей,
	//		ВыборкаДублей.Студент,
	//		ВыборкаДублей.НачислениеЗаУслугу,
	//		ВыборкаДублей.Контрагент,
	//		ВыборкаДублей.ДоговорКонтрагента,
	//		Формат(ВыборкаДублей.ПериодНачисленияНачало, "ДЛФ=D"),
	//		Формат(ВыборкаДублей.ПериодНачисленияКонец, "ДЛФ=D"),
	//		ВыборкаДублей.СтавкаОплаты
	//	);
	//	
	//	Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Начисления", ВыборкаДублей.НомерСтроки, "Студент");
	//	ОбщегоНазначения.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
	//	
	//КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
